tap "charmbracelet/tap"
tap "dotenvx/brew"
tap "flipt-io/brew"
tap "hashicorp/tap"
tap "homebrew/services"
tap "jandedobbeleer/oh-my-posh"
tap "ktr0731/evans"
tap "lusingander/tap"
tap "nats-io/nats-tools"
tap "stripe/stripe-cli"
tap "tsirysndr/tap"
tap "xataio/pgroll"
brew "awscli"
brew "axel"
brew "bash"
brew "bazelisk"
brew "buf"
brew "caddy"
brew "cargo-binstall"
brew "clojure"
brew "dua-cli"
brew "duckdb"
brew "elixir"
brew "etcd"
brew "ethereum"
brew "ffmpeg"
brew "fish"
brew "flex"
brew "gh"
brew "ghc"
brew "ghcup"
brew "gitoxide"
brew "gleam"
brew "glow"
brew "httpie"
brew "hurl"
brew "kotlin"
brew "litecli"
brew "minio"
brew "mycli"
brew "nats-server", restart_service: :changed
brew "neovim"
brew "nim"
brew "nixpacks"
brew "opam"
brew "openbao", restart_service: :changed
brew "opentofu"
brew "pgcli"
brew "pkl"
brew "protobuf"
brew "redis"
brew "ruby"
brew "swift"
brew "terraform", link: false
brew "tig"
brew "vhs"
brew "yq"
brew "zig"
brew "zsh"
brew "charmbracelet/tap/crush"
brew "dotenvx/brew/dotenvx"
brew "flipt-io/brew/flipt"
brew "hashicorp/tap/consul"
brew "hashicorp/tap/hcp"
brew "ktr0731/evans/evans"
brew "nats-io/nats-tools/nats"
brew "tsirysndr/tap/genius"
brew "tsirysndr/tap/mvola"
brew "tsirysndr/tap/tunein"
brew "xataio/pgroll/pgroll"
vscode "4ops.terraform"
vscode "apollographql.vscode-apollo"
vscode "bazelbuild.vscode-bazel"
vscode "bbenoist.nix"
vscode "betterthantomorrow.calva"
vscode "betterthantomorrow.calva-spritz"
vscode "bierner.docs-view"
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "bruno-api-client.bruno"
vscode "bufbuild.vscode-buf"
vscode "chenglou92.rescript-vscode"
vscode "d-biehl.robotcode"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "dhall.dhall-lang"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "fwcd.kotlin"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "gleam.gleam"
vscode "golang.go"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "hashicorp.terraform"
vscode "haskell.haskell"
vscode "jakebecker.elixir-ls"
vscode "justusadam.language-haskell"
vscode "llvm-vs-code-extensions.lldb-dap"
vscode "mathiasfrohlich.kotlin"
vscode "matthewpi.caddyfile-support"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-speech"
vscode "ms-vscode.vscode-typescript-next"
vscode "nimlang.nimlang"
vscode "nimsaem.nimvscode"
vscode "norgor.capnp"
vscode "nwolverson.ide-purescript"
vscode "nwolverson.language-purescript"
vscode "ocamllabs.ocaml-platform"
vscode "p1c2u.docker-compose"
vscode "pieterjongsma.swift-playgrounds"
vscode "pkief.material-icon-theme"
vscode "pkl.pkl-vscode"
vscode "prisma.prisma"
vscode "rust-lang.rust-analyzer"
vscode "scala-lang.scala"
vscode "shopify.ruby-lsp"
vscode "styled-components.vscode-styled-components"
vscode "swiftlang.swift-vscode"
vscode "tamasfe.even-better-toml"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "waderyan.gitblame"
vscode "ziglang.vscode-zig"
vscode "zxh404.vscode-proto3"
